IdeaRS.Connections
PlateOpeningData.ShapeCode Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the code of the opening 1 - rectangle 2 - circle PlateShapeCode.NonRegularRectangle - general square notch PlateShapeCode.Trapezoid - dog bone PlateShapeCode.CircularSegment - dog bone arc PlateShapeCode.Ngon - n-uhelnik
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int ShapeCode { get; set; }
Property Value
Type: Int32
See Also
Reference
PlateOpeningData Class
IdeaRS.Connections.Data Namespace